---
title: m4_11
date: 2020-05-07
---
Example Python program m4_11.py
Python version 3.x or newer.
To check the Python version use:

    python --version

## Modules

* import random;

## Code

Python example

    # Задание 11
    # У тренера футбольного клуба имеется список членов команды и
    # количества очков, которые принес команде каждый игрок в данном
    # сезоне. Составить программу, с помощью которой можно определить
    # самого результативного игрока.
    
    import random;
    
    print("Программа для определения самого результативного игрока")
    
    peopleCount = int(input("Введите количество играков: "))
    infoFromKeyword = False if (input("Cгенерировать количество очков автоматически(да/нет): ") == "да") else True
    points = [None] * peopleCount
    
    if infoFromKeyword :
        for i in range(1, peopleCount + 1):
            points[i-1] = int(input("Введите количество очков для " + str(i) + " игрока: "))
    else:
        for i in range(1, peopleCount + 1):
            points[i-1] = random.randrange(0, 100)
        print("Згенерировались следующие очки:", points)
    
    maxIndex = points.index(max(points))
    print("Самый результативный игрок под номером",maxIndex+1, ". Он имеет", points[maxIndex], "очк.")
    

## Useful Links

- Articles: https://python-commandments.org/
- Python shell: https://bsdnerds.org/learn-python/
