---
title: m4_12
date: 2020-05-07
---
Example Python program m4_12.py
Python version 3.x or newer.
To check the Python version use:

    python --version

## Modules

* import random
* from tkinter import *

## Methods

* def fibon(count):
* def maxFibon(maxElem):

## Code

Python tkinter example

    #Составить программу, которая:
    #а) выводит первые N чисел Фибоначчи; 
    #б) определяет, сколько кроликов будет через М месяцев; через G лет; 
    #в) позволит определить номер члена последовательности, значение
    #которого превосходит заданное число К; 
    #г) представить ряд Фибоначчи графически. Например:
    
    import random
    from tkinter import *
    
    def fibon(count):
        a = 0
        b = 1
        for i in range(count):
            a, b = b, a + b
        return a
    def maxFibon(maxElem):
        a = 0
        b = 1
        i = 0
        while maxElem >= a:
            a,b = b, a + b
            i += 1
        return {"index": i, "value": a}
    
    print("Программа для работы с числами фибоначи")
    
    numberCount = int(input("Сколько чисел Фибоначи выводить: "))
    monthCount = int(input("Узнать сколько кроликов будет через(введите число месяцев): "))
    yearCount = int(input("Узнать сколько кроликов будет через(введите число лет): "))
    maxElem = int(input("Введите число К: "))
    
    a = 0
    b = 1
    fib = [None] * numberCount
    for i in range(numberCount):
        a, b = b, a + b
        fib[i] = a
    print("Числа Фибоначи:", fib)
    print("Через", monthCount, "мес. будет", fibon(monthCount+2), "крол.")
    print("Через", yearCount, "год/лет будет", fibon(yearCount*12+2), "крол.")
    maxF = maxFibon(maxElem)
    print("Значение превосходящее число К(", maxElem, ") =",maxF["value"], "и имеет индекс", maxF["index"])
    qwe = Tk()
    qwe.title("Фибоначи")
    qwe.geometry('800x600')
    asd = Canvas(qwe, bg='white', width=800, height=600)
    asd.pack()
    a = 0
    b = 1
    color = ["red", "blue", "magenta", "lightgreen", "yellow", "lightblue"]
    for i in range(numberCount):
        a, b = b, a + b
        colorIndex = random.randint(0,5)
        asd.create_rectangle(0, i*10, a*10,(i+1)*10,fill=color[colorIndex])

## Useful Links

- Articles: https://python-commandments.org/
- Python shell: https://bsdnerds.org/learn-python/
- Tutorial: https://pythonprogramminglanguage.com/
